# Creating a DataFrame
   - pd.DataFrame() is a combination of rows & columns

### Python Dictionary

In [52]:
# Create a dictionary in python only single entity

# keys ---> columns
# values---> rows

persons = {
    'FName':'Mukesh',
    'LName':'Yadav',
    'Occupation':'Engineer',
    'Location':'Jaipur',
    'PinCode':303106,
    'Hobby':'Reading'
}

In [20]:
persons

{'FName': 'Mukesh',
 'LName': 'Yadav',
 'Occupation': 'Engineer',
 'Location': 'Jaipur',
 'PinCode': 303106,
 'Hobby': 'Reading'}

In [21]:
# Create a dictionary in python using multile entity using pythin lists

persons1 = {
    'FName':['Mukesh','Admin','Raja'],
    'LName':['Yadav', 'admin','Sastri'],
    'Occupation':['Engineer','Product Ownor','Architect'],
    'Location':['Jaipur', 'Delhi', 'Pink city'],
    'PinCode':['303106', '302020', '302016'],
    'Hobby':['Reading', 'Study','playing']
             }

In [22]:
persons1

{'FName': ['Mukesh', 'Admin', 'Raja'],
 'LName': ['Yadav', 'admin', 'Sastri'],
 'Occupation': ['Engineer', 'Product Ownor', 'Architect'],
 'Location': ['Jaipur', 'Delhi', 'Pink city'],
 'PinCode': ['303106', '302020', '302016'],
 'Hobby': ['Reading', 'Study', 'playing']}

In [47]:
persons1['FName'][2]

'Raja'

### Create a DataFrame

In [23]:
# Create a DataFrame
import pandas as pd

In [51]:

df = pd.DataFrame(persons1)
df

    FName   LName     Occupation   Location PinCode    Hobby
0  Mukesh   Yadav       Engineer     Jaipur  303106  Reading
1   Admin   admin  Product Ownor      Delhi  302020    Study
2    Raja  Sastri      Architect  Pink city  302016  playing

In [25]:
# Accessing a column is same as accessing a value from a dictionary
df['Hobby']

0    Reading
1      Study
2    playing
Name: Hobby, dtype: object

In [29]:
#Even we can access using (. dot) notation like this-
df.Hobby

0    Reading
1      Study
2    playing
Name: Hobby, dtype: object

In [30]:
# Here I will recommend to use 1st approach using [] because sometime columns name might be same as attributes name in that case dot natation will give error.
# eg. if data frame has a column name as count and accessing that using . notation will give error

In [31]:
# Check the type of the column-
type(df['Hobby'])

pandas.core.series.Series

In [32]:
#Series basically a list of data but like a data frame it has more functionality

### Access multiple columns from data frame-

In [34]:
df[['FName','Location','Hobby']]

    FName   Location    Hobby
0  Mukesh     Jaipur  Reading
1   Admin      Delhi    Study
2    Raja  Pink city  playing

In [35]:
#To check list of columns
df.columns

Index(['FName', 'LName', 'Occupation', 'Location', 'PinCode', 'Hobby'], dtype='object')

###  Access rows 
   - loc - searching by label
   - iloc - Allows us to access rows by using integer location

In [37]:
df.iloc[1]

FName                 Admin
LName                 admin
Occupation    Product Ownor
Location              Delhi
PinCode              302020
Hobby                 Study
Name: 1, dtype: object

In [38]:
# Access multiple rows
df.iloc[[0,1]]

    FName  LName     Occupation Location PinCode    Hobby
0  Mukesh  Yadav       Engineer   Jaipur  303106  Reading
1   Admin  admin  Product Ownor    Delhi  302020    Study

In [41]:
# we can also specify the column index for which we need data, 1st [] are for rows and 2nd [] for column index 
df.iloc[[0,1], 3]

0    Jaipur
1     Delhi
Name: Location, dtype: object

In [44]:
df

    FName   LName     Occupation   Location PinCode    Hobby
0  Mukesh   Yadav       Engineer     Jaipur  303106  Reading
1   Admin   admin  Product Ownor      Delhi  302020    Study
2    Raja  Sastri      Architect  Pink city  302016  playing

In [46]:
#Similarly we can use loc- we can mention the column name
df.loc[[0,1], 'PinCode']

0    303106
1    302020
Name: PinCode, dtype: object

In [49]:
# in the above line I've mentioned only 1 column name, if you want to access multiple column than pass list of columns

df.loc[[0,1], ['Hobby','FName']]

     Hobby   FName
0  Reading  Mukesh
1    Study   Admin

### Set Reset and use Index 
   - index selection should be unique

In [57]:
#Basically select the unique column for the index like empID columns or emailID

df.set_index('Hobby')

          FName   LName     Occupation   Location PinCode
Hobby
Reading  Mukesh   Yadav       Engineer     Jaipur  303106
Study     Admin   admin  Product Ownor      Delhi  302020
playing    Raja  Sastri      Architect  Pink city  302016

In [58]:
df

    FName   LName     Occupation   Location PinCode    Hobby
0  Mukesh   Yadav       Engineer     Jaipur  303106  Reading
1   Admin   admin  Product Ownor      Delhi  302020    Study
2    Raja  Sastri      Architect  Pink city  302016  playing

In [59]:
# To reflect the changes in the original data frame - 

df.set_index('Hobby', inplace=True)

In [60]:
df

          FName   LName     Occupation   Location PinCode
Hobby
Reading  Mukesh   Yadav       Engineer     Jaipur  303106
Study     Admin   admin  Product Ownor      Delhi  302020
playing    Raja  Sastri      Architect  Pink city  302016

In [74]:
# Previous we're using index from 0--n to access the rows but now we have set the new index so access like below-

df.loc['Reading']

FName           Mukesh
LName            Yadav
Occupation    Engineer
Location        Jaipur
PinCode         303106
Name: Reading, dtype: object

In [76]:
# But the index access from 0--n will work with iloc

df.iloc[0]

FName           Mukesh
LName            Yadav
Occupation    Engineer
Location        Jaipur
PinCode         303106
Name: Reading, dtype: object

In [79]:
# For reset index

df.reset_index(inplace=True)
df

   index    Hobby   FName   LName     Occupation   Location PinCode
0      0  Reading  Mukesh   Yadav       Engineer     Jaipur  303106
1      1    Study   Admin   admin  Product Ownor      Delhi  302020
2      2  playing    Raja  Sastri      Architect  Pink city  302016

     Hobby   FName   LName     Occupation   Location PinCode
0  Reading  Mukesh   Yadav       Engineer     Jaipur  303106
1    Study   Admin   admin  Product Ownor      Delhi  302020
2  playing    Raja  Sastri      Architect  Pink city  302016

### Filtering  - Using conditionals to filter Rows & Columns

In [82]:
df['Hobby'] == 'Reading'

0     True
1    False
2    False
Name: Hobby, dtype: bool

In [83]:
# Assign filter condition to our entire data frame - 

filterObj = (df['Hobby'] == 'Reading')

In [84]:
#1st approach to assign to data frame - 

df[filterObj]

   index    Hobby   FName  LName Occupation Location PinCode
0      0  Reading  Mukesh  Yadav   Engineer   Jaipur  303106

In [85]:
#2nd approach to assign to data frame - 

df[df['Hobby'] == 'Reading']

   index    Hobby   FName  LName Occupation Location PinCode
0      0  Reading  Mukesh  Yadav   Engineer   Jaipur  303106

In [90]:
#3rd approach to assign to data frame -  
# I prefer this approach bcz in the loc still we can do filtering based on the labels 


df.loc[filterObj]

#df.loc[filterObj, 'Location'] here Location is the column name, so the records which satisfy the boolean condition based on the column will appear here.

   index    Hobby   FName  LName Occupation Location PinCode
0      0  Reading  Mukesh  Yadav   Engineer   Jaipur  303106

In [98]:
# We can have many filtering condition using and(&), or(|) 

filerObj = (df['Hobby']=='Reading') & (df['FName']=='Mukesh')

#filerObj = (df['Hobby']=='Study') | (df['FName']=='Admin')

In [99]:
df.loc[filerObj]

   index    Hobby   FName  LName Occupation Location PinCode
0      0  Reading  Mukesh  Yadav   Engineer   Jaipur  303106

In [100]:
# Also we can do a negative condition
df.loc[~filerObj, 'Occupation']

1    Product Ownor
2        Architect
Name: Occupation, dtype: object